[
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 14,
    "companyName": "",
    "jobkey": "5668f6cf213f429f",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>OPEN RECRUITMENTOPEN UNTIL FILLEDIf you have ever taken a flight from BWI Thurgood Marshall airport; renewed your Maryland driver’s license; traveled to an Orioles game on the Light Rail; embarked on a cruise from the Port of Baltimore; received roadside assistance from CHART Emergency Patrol; reduced your commute time by using one of Maryland’s toll roads; or applied for Minority Business Enterprise (MBE) certification, then you have experienced some of the superb services provided by the Maryland Department of Transportation (MDOT). MDOT has various careers for people of all experiences, backgrounds, and abilities who come together to contribute to one mission—connecting our customers to life’s opportunities. Join us in serving our Maryland residents, visitors, and businesses! This is the journey level of high-voltage electrical work at the Maryland Department of Transportation (MDOT). Employees are responsible for independently performing high-voltage electrical installation, connection, maintenance, and repair work in compliance with Federal, State, and Local regulations and standard practices. High voltage electricians work with electric circuits carrying in excess of 600 volts, in accordance with the National Electrical Code and the Underwriter's Rules, for electrical wiring and installation.This is maintenance work requiring physical exertion performed either outdoors under all weather conditions or inside an MDOT building. Employees may be required to move objects weighing over 50 pounds, and may also be required to work on equipment located on high poles or other elevated locations, and/or perform their job in cramped quarters in buildings or underground. Employees in this classification are considered essential employees and are subject to emergency call back procedures, twenty-four hours a day, as may be required in order to maintain continuous operation of a facility. Employees may be required to work rotating shift work, to include evenings, nights, weekends, and holidays.The current vacancy exists at the Maryland Transportation Authority (MDTA) at the Baltimore Harbor Tunnel in Baltimore City, MD. The eligible list produced from the High Voltage Electrician (Skilled Trade Specialist III) may be utilized for other future openings within MDOT.MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFIATIONS:</b> Education: Graduation from an accredited high school or possession of a high school equivalency certificate.Experience: Four (4) years of experience working with high-voltage (600 volts and up) service, switch gear, and control wiring or large (30 horsepower or more) motors, compressors, and motor circuitry is required. Two (2) years of this experience must have been in a commercial or industrial setting. Please note that your application must specify the high voltage job duties performed.Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. Notes: 1. Additional work experience performing skilled trades work as defined above may be substituted on a year-for-year basis for the required education.2. A certificate from a vocational-technical school with a major in one or more of the skilled trades as defined above may be substituted for one year of the required general experience.3. Candidates may substitute U.S. Armed Forces military service experience as a non-commissioned officer in utilities repair classifications or construction and engineering specialty codes in the skilled trades as defined above field of work, on a year-for-year basis for the required experience. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. Candidates appointed to positions in this classification are assigned duties that require the operation of motor vehicles. Employees are required to possess a motor vehicle operator's license valid in the State of Maryland. All applicants must list their license number and expiration date on the application. 2. During the probationary period, employees may be required to obtain and maintain a Class A or Class B Commercial Driver's License (CDL) valid in the State of Maryland, depending on the type of equipment operated. 3. The employing administration may require employees to satisfy its agency training, and certification program requirements to obtain and maintain permanent status in this classification. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>1. Employees must be willing and available for duty at such hours, day or night, as may be required to maintain continuous operation of a facility and are subject to call-in. 2. Employees are required to maintain a reliable communication link for emergency call back requirements.3. Employees who work with, or may be exposed to, hazardous materials such as asbestos, lead-based paint, or chromium, may be required to undergo periodic medical testing and may be required to pass hazardous materials training and can wear a respirator. 4. Applicants may be required to demonstrate the ability to perform maintenance work on high structures and in cramped quarters.5. Employees in this classification are considered \"Essential Employees\" and must sign and agree to all policies and procedures relating to \"Essential Employee\" status. 6. Candidates will be subject to pre-employment drug testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs.7. Employees in this classification are subject to substance abuse testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs.TO APPLY: You must complete an MDOT employment application (DTS-1) online to be considered for this recruitment. RESUMES CANNOT BE SUBSTITUTED FOR THE MDOT EMPLOYMENT APPLICATION. No paper applications will be accepted. Selected candidates may be subject to background and reference checks. You may apply online at: https://www.governmentjobs.com/careers/mdotmd Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please notify in advance. MD Relay Service Number (711). Bilingual applicants are encouraged to apply. The Maryland Department of Transportation is not sponsoring new employees in application of the H1B Visa or providing an extension of an existing H-1B at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees; all sponsorship fees must be assumed by the potential employer. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). The incumbent in this position may be a member of a covered bargaining unit. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Issue Date: 3/11/2021"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 13,
    "companyName": "",
    "jobkey": "1b64e42b1d8e3762",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>OPEN RECRUITMENTOpen Until Filled This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this Maryland Transportation Authority (MDTA) position/function only. All interested persons will need to re-apply for any future recruitment conducted of this classification. The Maryland Transportation Authority (MDTA) owns, operates, and maintains eight major toll facilities comprised of four bridges, two tunnels, and two turnpikes, across the State of Maryland. For 50 years, the MDTA has provided Maryland's citizens and visitors with safe, secure and convenient transportation facilities. We are committed to quality and excellence in customer service, and we rely on our organization's values, traditions and – most importantly – our employees to achieve these goals. Nature of Work: This position is responsible for the development of engineering plans, specifications, and estimates with respect to Intelligent Transportation Systems (ITS) and Electrical scopes by applying engineering theories, principles, and standards. The incumbent in this position will perform the redrafting, computing, research report writing, checking of plans, and direction of field operation involved in the planning and designing of a variety of ITS and Electrical projects. Duties for this position include, but are not limited to, the following: Reviews plans for engineering accuracy, adequacy and compliance with federal, state, and local design regulations and standards including the National Environmental Policy Act (NEPA) and American Association of State Highway Transportation Officials (AASHTO);Works with surrounding agencies and internal MDTA divisions to ensure project coordination for small and less complex projects are complete;Assists with managing on-call contracts including reviewing costs and quantities;Completes ITS/Electrical engineering specifications;Assist in the rating of consultant Expressions of Interest and technical proposals for the purpose of obtaining expertise and manpower to execute ITS/Electrical projects; Supervises a team of engineers comprised of both full time and part-time ITS/Electrical Engineering consultants; Assigns and reviews the work of ITS/Electrical team members;Manage ITS/Electrical projects from beginning to completion abiding by MDTA project delivery guidelines; andCoordinates with other MDTA engineering disciplines and project stakeholders from MDTA Facility Operations, Maintenance and Construction divisions.Employees in this position will report directly to the ITS/Electrical Discipline Manager. The current vacancy exists in Baltimore, Maryland at the MDTA Francis Scott Key (FSK) Office of Engineering and Construction Building. Hybrid telework schedules may be available for this position.MDTA employees are offered a generous benefits package including: a minimum of 10 paid holidays, a minimum of 27* days of leave annually (personal, vacation, and sick), access to the State Pension System, deferred compensation plans, excellent health, dental, and vision plans, and more! *May be prorated based upon start date. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Education:</b> Possession of a bachelor's degree in engineering from an accredited college or university. Experience: Seven (7) years experience in professional engineering. **Two (2) years of this experience must have involved ITS or Electrical design and project management. *This statement contains a selective qualification, which is more focused in scope than the minimum qualifications for this classification. Selective qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skill or ability). Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one (1) position at the same employer, please list each position that you held and the length of time that you held each position.Notes: 1. Additional work experience in professional engineering, or in technical engineering at the journey level or above, may be substituted on a year for year basis for the required education.2. Possession of a Master's Degree in engineering may be substituted for one year of the non-supervisory experience. 3. Persons currently registered as Professional Engineers in the State of Maryland, or in a state with comparable requirements, are considered to have met the education requirements \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. Employees in this class may be required to possess a Professional Engineer, Land Surveyor, or Property Line Surveyor License.2. Employees in this classification may be assigned duties which require the operation of a motor vehicle. Employees assigned such duties will be required to possess a motor vehicle operator's license valid in the State of Maryland. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>APPLICATION PROCESS:</b> Please apply on-line at https://www.governmentjobs.com/careers/mdotmd. RESUMES CANNOT BE SUBSTITUTED FOR THE ONLINE EMPLOYMENT APPLICATION. Paper applications (Form DTS-1) will not be accepted for this recruitment. All applications must be received by 09/01/2022. NOTES: Please be advised that the State of Maryland is dedicated to a drug-free workplace, and as a result, employees are subject to the State's Substance Abuse Policy to include possible drug testing. Selected candidate(s) may be subject to background and reference checks. The incumbent in this position will not be a member of a covered bargaining unit.For education obtained outside the U.S., at the time of application you are required to provide proof of the equivalent American education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). This must be submitted as an attachment with the application of the position in which you are applying.The Maryland Transportation Authority is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDTA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Reasonable Accommodations for persons with disabilities will be provided upon request. Appropriate auxiliary aids and services for qualified individuals with disability will be provided upon request. Please notify us in advance. MD Relay Service Number 1-800-735-2258 (TTY Number: 711). Bilingual applicants are encouraged to apply. Issue Date: 08/29/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 12,
    "companyName": "",
    "jobkey": "4feacf96692d6126",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>MARYLAND DEPARTMENT OF TRANSPORTATION MARYLAND TRANSIT ADMINISTRATIONPrincipal Systems Engineer (Transportation Engineering Manager I) 0515 Career ServiceOpen to all qualified applicants Position Specific Recruitment **** ACCEPTING ON-LINE APPLICATIONS ONLY **** **Bilingual applicants are encouraged to apply** Are you seeking a job where your work is rewarding and provides excellent benefits? The Maryland Department of Transportation Maryland Transit Administration (MDOT MTA) invites you to apply today to be considered for a position that provides customer service to the citizens of Maryland every day. The MDOT MTA is one of the largest transit systems in the United States and is seeking dynamic and energetic individuals to join the MDOT MTA team.This is a position-specific recruitment. The resulting list of eligible candidates will be used to fill this MDOT MTA position/function only. All interested persons will need to re-apply for any future recruitments conducted for this classification. If you indicated veteran status on your application, you must submit your DD-214 along with the completed DTS-1 (application). The Maryland Department of Transportation Maryland Transit Administration (MDOT MTA) is seeking a Principal Systems Engineer (Transportation Engineering Manager I) to work in the Office of Engineering and Construction. The Principal Systems Engineer will be responsible for managing the design and construction management of Systems and Equipment Engineering projects related to Bus, Metro, Light Rail, MARC, and Freight. This function is electro-mechanical, telecommunications, electronics, and information technology in nature. Projects managed include construction, architectural &amp; engineering, new equipment, and overhaul contracts related to traction power, signaling &amp; train control, third rail and catenary systems, corrosion control, communications, intelligent vehicle transportation systems, supervisory control &amp; data acquisition, track and civil engineering work. Employee prepares rehabilitation of a variety of complex transit engineering systems. The employee in the classification will also be responsible for supervising engineers and other professional technical and clerical employees as well as professional engineering consultants. The Principal Systems Engineer receives supervision from the Manager of Systems &amp; Equipment Engineering.The current position is located in Baltimore City, Maryland. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFICATIONSEducation:</b> Possession of a bachelor's degree in Engineering from an accredited college or university.Experience: Seven (7) years experience in Professional Engineering. **Two (2) years of this experience must involve working in mass transit, specifically with train control and signaling systems, traction power, supervisory control and data acquisition, corrosion control, as well as intelligent vehicle transportation and communication systems (i.e., fiber optic, radio frequency, microwave, etc.).** A Selective qualification recruitment is conducted for a job or position when there is a specific or additional bona fide occupational qualification (i.e., knowledge, skill or ability).The ideal candidate will be certified through the National Association of Corrosion Engineers (NACE). The candidate will also have a Project Management Professional (PMP) certification.Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part-time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position Notes: 1. Additional work experience in professional engineering, or in technical engineering at the journey level or above, may be substituted on a year for year basis for the required education. There are no substitutions for the noted Selective Qualifications. 2. Possession of a Master's Degree in engineering may be substituted for one year of the non-supervisory experience.3. Persons currently registered as Professional Engineers in the State of Maryland, or in a state with comparable requirements, are considered to have met the education requirements \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. Employees in this class may be required to possess a Professional Engineer, Land Surveyor, or Property Line Surveyor License.2. Employees in this classification may be assigned duties which require the operation of a motor vehicle. Employees assigned such duties will be required to possess a motor vehicle operator's license valid in the State of Maryland. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>TO APPLY:</b> You must complete a Maryland Department of Transportation (MDOT) employment application (Form DTS-1) to be considered for this recruitment. Resumes may not be substituted for the application. It is essential that the application is filled out completely and accurately, listing all relevant experience in detail and addressing the specific requirements shown above. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for within MDOT, one of the Transportation Business Units, or the Authority. Applications must be completed and submitted online by registering at https://www.governmentjobs.com/careers/mdotmd. Please make sure you meet the minimum and selective qualifications and follow the instructions on MDOT's Online Employment Center website. Selected candidates may be subject to background and reference checks. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). Reasonable accommodations for persons with disabilities will be provided as requested. TTY call 711.TTY Users May Also Call Their Telecommunications Relay Service The incumbent in this position will not be a member of a covered bargaining unit. The Maryland Department of Transportation Maryland Transit Administration is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees; all sponsorship fees must be assumed by the potential employer. MDOT MTA is an Equal Opportunity Employer. MDOT MTA Does Not Discriminate Based On: Age, Ancestry, Color, Creed Gender Identity or Expression, Genetic Information, Marital Status, Mental or Physical Disability, National Origin, Race, Religious Affiliation, Belief or Opinion, Sex or Sexual Orientation or any other protected status.Issue Date: 05/06/22"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 11,
    "companyName": "",
    "jobkey": "0e68873a95d90d7a",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Maryland Department of Transportation State Highway Administration (OPEN)Assistant Division Chief - Lab (Transportation Engineering Manager II) Grade 21 (2707) SP# 22-73-35YOU MUST APPLY ONLINE TO BE CONSIDERED FOR THIS POSITIONhttp://www.governmentjobs.com/careers/mdotmd THE RECONSIDERATION PERIOD FOR THIS RECRUITMENT IS THREE (3) BUSINESS DAYS The Maryland Department of Transportation State Highway Administration (MDOT SHA) Office of Materials Technology (OMT), Soils and Aggregate Technology Division (SATD) (Anne Arundel County) is recruiting for an Assistant Division Chief - Lab (Transportation Engineering Manager II). This position is open to anyone who meets the minimum and selective qualifications* listed below. This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this MDOT SHA position or function only. You will need to reapply for any future recruitment conducted for this job classification.This Assistant Division Chief (ADC) is responsible for managing the overall operations of the laboratory in the Soils and Aggregate Technology Division (SATD). The ADC will manage permanent and consultant staff responsible for testing and analyzing soil and aggregate materials, and their components, for pavement, bridges, and drainage structures for highways. Moust of the work is conducted in the lab environment. The incumbent will provide direction to staff based on engineering physical science principles and knowledge of soils and aggregate technology and materials. The ADC will represent the division at various management, technical, and partnering meetings, and assume the responsibility of the Division Chief in his/her absence. The incumbent will also participate in soils and aggregate technology improvement activities at the regional and national level. The ADC will ensure that the lab operations at MDOT SHA and through consultant testing agreements are being conducted according to national and industry standards set by American Association of State Highway and Transportation Officials (AASHTO), American Society for Testing and Materials (ASTM), American Concrete Institute (ACI), etc. The ADC will also be responsible for the supervision and career development of Soils and Aggregate laboratory operations section employees.MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits Guide. \"The Maryland Department of Transportation State Highway Administration (MDOT SHA) has been named Training Magazine’s Training APEX Awards for the third consecutive year.\" \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFICATIONS:</b> EDUCATION: Possession of a bachelor's degree in engineering from an accredited college or university. EXPERIENCE: Eight (8) years of experience in professional engineering, including one (1) year of supervisory or consultant management experience. SELECTIVE QUALIFICATIONS: Four (4) years of experience in quality assurance (QA) materials testing processes, and evaluation of the geotechnical materials (e.g., soils, aggregates, furnished landscaping materials, and geotextiles) used for pavement, embankments, and/or highway construction. This statement contains a selective qualification, which is more focused in scope than the minimum qualifications for this classification. Selective qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skill, or ability). PREFERRED QUALIFICATIONS: The ideal candidate will possess the following: Knowledge of lab equipment used to measure index and mechanical properties of soils, aggregates, and related materials.Ability to troubleshoot material testing and application problems related to performance in the field.Excellent oral and written communication skills. Teamwork and management experience, and knowledge of databases.NOTES: 1. Additional work experience in professional engineering, or in technical engineering at the journey level or above, may be substituted on a year for year basis for the required education.2. Possession of a master's degree in engineering may be substituted for one year of the non-supervisory experience.3. Persons currently registered as Professional Engineers in the state of Maryland, or in a state with comparable requirements, are considered to have met the education requirements. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>Candidates must possess a motor vehicle operator's license valid in the state of Maryland. All applicants must list their license number and expiration date on the application. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>TO APPLY:</b> All applicants must submit an application online at http://www.governmentjobs.com/careers/mdotmd. Resumes will not be accepted in lieu of completed applications. To receive credit for your work history and credentials you must list the information on the online DTS-1 application form. You may refer to a resume only to expand on information offered in the body of the online DTS-1 application. Applications must be submitted online by the closing date. The selected candidate may be subject to background and reference checks. A conviction is not an automatic disqualification from employment. Bilingual applicants are encouraged to apply. Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. The state of Maryland offers excellent health and leave benefits, 401k benefits, pension plan a free transit program, and advanced education and training opportunities. The incumbent in this position will not be a member of the covered bargaining unit. PLEASE NOTE: The Maryland Department of Transportation State Highway Administration is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). If you have any questions, please contact the Recruitment and Examination Division at: 410-545-5571 Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please call 410-545-5554. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT SHA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Issued Date: 11/18/22"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 10,
    "companyName": "",
    "jobkey": "d0a6e4ae4793f9f4",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>OPEN RECRUITMENTOpen Until Filled This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this Maryland Transportation Authority (MDTA) position/function only. All interested persons will need to re-apply for any future recruitment conducted for this classification. The MDTA owns, operates, and maintains eight major toll facilities comprised of four bridges, two tunnels, and two turnpikes, across the State of Maryland. For 50 years, the MDTA has provided Maryland's citizens and visitors with safe, secure and convenient transportation facilities. We are committed to quality and excellence in customer service, and we rely on our organization's values, traditions and – most importantly – our employees to achieve these goals. Nature of Work: This position is responsible for the ensuring adherence to quality maintenance and repair standards on various facility maintenance and service contracts. The incumbent in this position will develop and implement the Preventative Maintenance program for all MDTA facilities to ensure the uniformity of standards with the MDTA Asset Management Program. Duties and responsibilities for this position include, but are not limited to the following: Provides technical support to the Office of Engineering and Construction (OEC) and Support Services Division (SS) on various maintenance and service contracts by developing, reviewing, and approving scope of work, specifications, change orders, and invoices of maintenance contracts;Develops, implements, and maintains the preventative maintenance and warranty program for all maintenance and service contracts and ensure compliance by the contractor to ensure that MDTA is up-to-date with all regulatory requirements and COMAR;Attends all facility maintenance contracts kick- off meetings and partnering meetings;Provides recommendations to OEC and SS on the need for upcoming facilities preventative maintenance contracts;Coordinates and works with the Chief Facilities Maintenance Officer (CFMO) from various facilities to identify facility assets and conducts annual inspections of facility assets;Responsible for development of staff, approving leave requests, time sheets and evaluation of performance;Responds to emergency facility situations as needed; Provide monthly reports of facility maintenance contracts progress to the Director of Asset Management and Support Services; and Coordinates and works with Maximo team to ensure that facility assets, condition assessments and preventative maintenance program are entered into Maximo The employee in this position will receive direct supervision from the Director of Asset Management and Support Services. The current vacancy is located in Baltimore, Maryland. Hybrid telework schedules may be available for this position.MDTA employees are offered a generous benefits package including: a minimum of 10 paid holidays, a minimum of 27* days of leave annually (personal, vacation, and sick), access to the State Pension System, deferred compensation plans, excellent health, dental, and vision plans, and more! *May be prorated based upon start date. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Education:</b> Possession of a bachelor's degree in engineering from an accredited college or university. Experience: Seven (7) years experience in professional engineering. ** Three years of this experience must have involved facility management or building maintenance program management. **This statement contains a Selective Qualification, which is more focused in scope than the Minimum Qualifications for this classification. Selective Qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skills or abilities). No substitutions are allowed for a Selective Qualification.Your placement on an eligible list may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for.Notes: 1. Additional work experience in professional engineering, or in technical engineering at the journey level or above, may be substituted on a year for year basis for the required education. 2. Possession of a Master's Degree in engineering may be substituted for one year of the non-supervisory experience. 3. Persons currently registered as Professional Engineers in the State of Maryland, or in a state with comparable requirements, are considered to have met the education requirements. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>Applicants must possess a motor vehicle operator's license valid in the State of Maryland. Applicants must list the license number and date of expiration on the application. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>APPLICATION PROCESS:</b> Please apply on-line at https://www.governmentjobs.com/careers/mdotmd. RESUMES CANNOT BE SUBSTITUTED FOR THE ONLINE EMPLOYMENT APPLICATION. Paper applications (Form DTS-1) will not be accepted for this recruitment. NOTES: Please be advised that the State of Maryland is dedicated to a drug-free workplace, and as a result, employees are subject to the State's Substance Abuse Policy to include possible drug testing. Selected candidate(s) may be subject to background and reference checks. The incumbent in this position is not a member of a covered bargaining unit.For education obtained outside the U.S., at the time of application you are required to provide proof of the equivalent American education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). This must be submitted as an attachment with the application of the position in which you are applying. The Maryland Transportation Authority is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDTA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. MDOT has various careers for people of all experiences, backgrounds, and abilities who come together to contribute to one mission - connecting our customers to life’s opportunities. Join us in serving our Maryland residents, visitors, and businesses! Reasonable Accommodations for persons with disabilities will be provided upon request. Appropriate auxiliary aids and services for qualified individuals with disability will be provided upon request. Please notify in advance. MD Relay Service Number 1-800-735-2258 (TTY Number: 711). Bilingual applicants are encouraged to apply. Issue Date: 06/23/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 9,
    "companyName": "",
    "jobkey": "f59a92baa4a85f76",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Microsoft .NET Developer (IT Programmer Analyst Lead/Advanced) OPEN RECRUITMENT*Previous applicants need not reapply Position Specific Recruitment This is a position specific recruitment and is open to anyone who meets the minimum and selective qualification* listed below. The resulting list of eligible candidates will be used to fill this Maryland Department of Transportation Motor Vehicle Administration (MDOT MVA) position or function only. You will need to reapply for any future recruitment conducted for this job classification. The Maryland Department of Transportation Motor Vehicle Administration (MDOT MVA) is seeking a qualified candidate for the position of Microsoft .NET Developer (IT Programmer Analyst Lead/Advanced). Responsibilities Include: Using programming languages or other developmental tools to design, code, compile and test software applicationsDebugging and troubleshooting software errors, issues, and other problemsDeveloping solutions to software issues and participating in testingMaintaining applications by evaluating and revising as requiredWorking with end users in planning, developing, evaluating, revising, and testing applicationsAnalyzing data to determine the purpose of the application and finding a solution to the problemReading technical literature and software manuals to further their knowledge of the various computer languages and assist in resolving problems with the applicationDeveloping and assembling applications and user documentationsProviding advice and guidance to lower-level IT Programmers on how to solve problems in designing, developing, testing, implementing, and maintaining applicationsThe current vacancy exists in MDOT MVA’s Software Development Office in Glen Burnie, MD (Anne Arundel County). \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Minimum Qualifications:</b> Education: A bachelor's degree from an accredited college or university in Information Technology, Computer Science, Management Information Systems, or other information technology related field Experience: Two (2) years of experience designing, developing, testing, implementing, and maintaining applications systems and programs using generally accepted computer programming languages or other developmental tools. ** One (1) year of this experience must have included utilizing established development tools, guidelines and conventions including but not limited to: Microsoft .NET Technologies, Visual Studio, ASP.NET, SQL Server, HTML, WPF, XML, CSS, JavaScript, C#, C++, and VB.NET. **SELECTIVE QUALIFICATION recruitments are utilized when the position requires specific or additional bona fide occupational qualifications (knowledge, skills and abilities). No substitutions are allowed for a Selective Qualification. Notes: 1. Candidates may substitute six credit hours of coursework in application analysis and programming using generally accepted computer programming languages or other developmental tools for six months of the required experience. 2. Candidates may substitute completion of high school or a high school equivalency certificate and eighteen months of experience converting data from project specifications by writing program code using generally accepted computer programming languages or other developmental tools for the required education; or candidates that lack high school or equivalency certificate may substitute experience in one of the following areas: operating computers, scheduling, controlling input and output or maintaining backups or data storage, processing data on computers, evaluating, implementing and maintaining, hardware and software, on a year-for-year basis for a high school education. 3. Candidates may substitute completion of high school or a high school equivalency certificate and fifteen credits from an accredited college or university in systems analysis and application programming using generally accepted computer programming languages or other developmental tools for the required education. 4. U.S. Armed Forces military service experience as defined under the Experience Requirement of the Minimum Qualifications may be substituted for the required education and experience on a year-for-year basis. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>None. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>To Apply:</b> Submit a DTS-1 application online at: https://www.governmentjobs.com/careers/mdotmd . The application must be complete at the time of submission and must clearly describe the required work experience. Employment dates (month and year) must be stated. Vague descriptions of experience will not be considered. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position.Description of duties that state, \"see resume\" will negatively impact consideration for this position. Applicants will not be contacted for additional information. Only applicants considered for this position will be contacted. Applications submitted online must be received by 11:59 PM if a closing date is noted. If you have general questions regarding employment opportunities with the Maryland Department of Transportation Motor Vehicle Administration (MDOT MVA), please call 410-787-7719. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). The MDOT MVA is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. The MDOT MVA is an equal opportunity employer. The MDOT MVA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. The incumbent in this position may be a member of a covered bargaining unit. The state of Maryland is dedicated to a drug-free workplace, and as a result, employees are subject to the State's Substance Abuse Policy to include possible drug testing. Reasonable accommodations will be provided upon request. The selected candidate may be subject to background and reference checks. A conviction is not an automatic disqualification to employment. Erroneous, misleading, or fraudulent information on an application is sufficient grounds for rejection from the hiring process, withdrawal of an offer for employment or immediate discharge. Relay Service: 1-800-201-7165 TTY: 1-800-492-4575 An EEO/AA Employer Date Issued: 5/10/2022 Reissued 7/1/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 8,
    "companyName": "",
    "jobkey": "74aa989117e3720f",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Open RecruitmentOpen Until FilledThis is a position specific recruitment, open to anyone who meets the minimum and selective qualifications listed below. The resulting list of eligible candidates will be used to fill this position or function only. You will need to reapply for any future recruitment conducted for this job classification. The Maryland Department of Transportation Maryland Aviation Administration (MDOT MAA) is the owner &amp; operator of both BWI Thurgood Marshall and Martin State Airports, serving over 27 million passengers annually. Powered by PERFORMANCE. Inspired by INNOVATION. Fueled by FUN. we are chartering careers to unprecedented Successes, Opportunities, Advancements, Results, and Service. If you’re beginning your career journey or performing at your peak level, we invite you to consider our aviation family for your career. MDOT MAA is currently accepting applications for the position of Plumber (Skilled Trade Specialist II) at the Baltimore/Washington International Thurgood Marshall Airport (BWI Marshall Airport). Employees in this class are required to perform various duties such as: Installing, repairing, and maintaining plumbing and natural gas equipment, piping, valves, and fittings in compliance with the Maryland State and International Plumbing CodesInstalling valves and piping from ‘A” to 12”. Installation and repairs to showers, lavatories, water closets, faucets, and urinalsFitting copper pipes and fittings using assorted flux, solder, and brazing materials Using different types of gases (i.e., map, and acetylene to fit and cut copper and steel pipes). Installing steel, water, natural gas by using power threaders and groves to cut, thread, and grove the ends of the pipingTroubleshooting and repairing sewage ejector pumps, motors, and controls This is maintenance work requiring physical exertion performed either outdoors under all weather conditions or inside an MDOT MAA building. On some assignments, employees may be required to move objects weighing over 50 pounds and may also be required to work on equipment located on high poles or other elevated locations, and/or perform their job in cramped quarters in buildings or underground. Employees in this class are considered essential employees and are subject to emergency call-back procedures, twenty-four hours a day, as may be required to maintain the continuous operation of a facility. Employees may be required to work rotating shift work, including evenings, nights, weekends, and holidays. This position is an emergency essential position. All employees designated as emergency essential are required to be available to work during weather, operational, and/or disaster emergency conditions. Furthermore, this position requires work in a 24- hour facility and you must be available to work any shift as required by the operational needs of the MDOT MAA.This position is located at BWI Marshall Airport in Anne Arundel County, MD. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Minimum Qualifications:</b> Education: Graduation from a standard high school or possession of a high school equivalency certificate. Experience: Three years of experience performing skilled trade work in plumbing. *Two years of this experience must have involved service and repair of various plumbing hardware in the commercial and residential setting including faucets, water heaters, utility sinks, ejector pumps, grease interceptors, troubleshooting leaks, and using drain clearing machinery used in the plumbing trade. *This statement contains a Selective Qualification, which is more focused in scope than the Minimum Qualifications for this classification. Selective Qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skills, or abilities). Notes: 1. Additional work experience performing skilled trades as defined above may be substituted on a year-for-year basis for the required education. 2. A certificate from a vocational-technical school with a major in one or more of the skilled trades as defined above may be substituted for one year of the required general experience. 3. Candidates may substitute U.S. Armed Forces military service experience as a non-commissioned officer in utility repair classifications or construction and engineering specialty codes in the skilled trades as defined above the field of work, on a year-for-year basis for the required experience. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. Candidates appointed to positions in this classification are assigned duties that require the operation of motor vehicles. Employees are required to possess a motor vehicle operator's license valid in the State of Maryland. All applicants must list their license number and expiration date on the application. 2. During the probationary period, employees may be required to obtain and maintain a Class A or Class B Commercial Driver's License (CDL) valid in the State of Maryland, depending on the type of equipment operated. 3. Employees at the Maryland Aviation Administration must have or obtain an Airfield Operators Permit in accordance with the Code of Maryland Regulations 11.03.01.04, Control of Vehicular Traffic on the Air Operations Area, prior to permanent appointment. 4. The employing administration may require employees to satisfy its agency training and certification program requirements to obtain and maintain permanent status in this classification. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>1. Applicants who are considered for work at the Maryland Aviation Administration are subject to an extensive pre-employment security background check as required by the Federal Aviation Administration, Federal Aviation Regulation Part 107. 2. Employees must be willing and available for duty at such hours, day or night, as may be required to maintain continuous operation of a facility and are subject to call-in. 3. Employees are required to maintain a reliable communication link for emergency call back requirements. 4. Employees who work with, or may be exposed to, hazardous materials such as asbestos, lead-based paint or chromium, may be required to undergo periodic medical testing and may be required to pass hazardous materials training and can wear a respirator. 5. Applicants may be required to demonstrate the ability to perform maintenance work on high structures and in cramped quarters. 6. Employees in this classification are considered \"Essential Employees\" and must sign and agree to all policies and procedures relating to \"Essential Employee\" status. 7. Candidates will be subject to pre-employment drug testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs. 8. Employees in this classification are subject to substance abuse testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs.To Apply: ****ACCEPTING ONLINE APPLICATIONS ONLY**** TO APPLY: You may apply online at https://www.governmentjobs.com/careers/mdotmd to be considered for this recruitment. RESUMES CAN NOT BE SUBSTITUTED FOR THE MDOT EMPLOYMENT APPLICATION. It is essential that the application is filled out completely and accurately, listing all relevant experience in detail and addressing the specific requirements shown above. This includes, but is not limited to, full or part-time, volunteer, military, acting capacity, or any other experience that is relevant to this position. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. Your application must be received by 07/11/2022. Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please notify in advance. MD Relay Service Number (711). Bilingual applicants are encouraged to apply. The selected candidate may be subject to background and reference checks. The Maryland Department of Transportation is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. Applicants who have education obtained outside of the United States will be required to provide proof of the equivalent United States education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Service (http://www.naces.org) or the Collegiate Registrars &amp; World Education Services: International Credential Evaluation (https://www.wes.org/). The incumbent in this position may be a member of a covered bargaining unit. WE ARE AN EQUAL OPPORTUNITY EMPLOYER, MDOT MAA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. 5/23/2022Re-Issued: 6/27/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 6,
    "companyName": "",
    "jobkey": "6bf1a80481008be1",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Maryland Department of Transportation Maryland Transit AdministrationA-Repairman-Electrician (Repairman-Bus) (8614)Open to all qualified employeesApplicants must apply online.Bilingual applicants are encouraged to applyThe Maryland Department of Transportation Maryland Transit Administration offers excellent benefits.Are you seeking a job where your work is rewarding and provides excellent benefits?The Maryland Department of Transportation's Maryland Transit Administration (MDOT) (MTA) invites you to apply today to be considered for a position that provides customer service to the citizens of Maryland every day. The MDOT MTA is one of the largest transit systems in the United States and is seeking dynamic and energetic individuals to join the MDOT MTA team.DESCRIPTIONThe Maryland Department of Transportation Maryland Transit Administration (MDOT) (MTA) seeks an A-Repairman- Electrician to install, troubleshoot, repair and maintain the following systems: transformers, motors and their control circuits, HVAC systems, motor operated door, boilers, power distribution systems and all types of lighting within facilities and buildings operated and maintained by the MTA. The incumbent must be able to read blueprints, schematics. He/she may be required to lift heavy objects, work in elevated locations and in cramped quarters. The work will be performed at various MTA facilities and perform various other duties as assigned to the facilities maintenance department.The current vacancy is located at the Maryland Department of Transportation Maryland Transit Administration (MDOT MTA) in Baltimore, Maryland.The current work schedule is Monday thru Friday 7:00am-3:30pm with Saturday &amp; Sunday off. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFICATIONSEducation:</b> Graduation from an accredited high school or possession of a GED recognized by the State of Maryland. Experience: Four (4) years of electrical experience performing installation, maintenance and repair work involving all electrical circuits carrying 600 volts. Must have knowledge of the National Electrical Code. Completed a certified Industrial Electrical Apprenticeship or Trade School. Possess a Journeyman Wireman’s card/certification. Electrical Master’s License or equivalent is acceptable.SUBSTITUTION INFORMATIONCandidates may substitute U.S. Armed Forces military service experience involving staff work related to the administration of rules, regulations, policies, procedures and processes, or overseeing or coordinating unit operations or functioning as a staff assistant on a year-for-year basis for the required education and experience.NOTE: A written examination will be given to all qualified applicants to fill current and future vacancies.SPECIAL REQUIREMENTS1. Employee will be required to have and maintain a reliable communication link for the purpose of emergency call back requirements.2. Employee may be required to work shifts, evenings, holidays, and weekends.3. Employee may be exposed to a variety of hazards, requiring the wearing of protective clothing and the use of appropriate safety and Personal Protective Equipment.4. Employees in this position are considered \"Essential Employees\" and will be required to sign and agree to all policies and procedures relating to \"Essential Employee\" status.5. Eligible applicants may be subject to background investigation under Federal and State laws and regulations. A conviction is not an automatic disqualification to employment. Erroneous, misleading or fraudulent information on the application is sufficient grounds for rejection from the hiring process, removal from the list of eligible, withdraw of an offer for employment or immediate discharge.6. Employees in this classification are subject to pre-employment drug testing and substance abuse testing in accordance with the Code of Federal Regulations 49-Federal Department of Transportation Drug Alcohol Testing Protocols and Federal Transit Administration Alcohol Testing Rules, and Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>Applicants must possess a Driver's License valid in the State of Maryland. Applicants must list the license number and date of expiration on the applicationNOTE: You MUST submit the following documentation with your application or your application WILL NOT be accepted: A copy of your degree or certificate from an accredited industrial electrical apprenticeship program or a copy of your Baltimore County Master's Limited License or Baltimore City Restricted Electrical License, equivalent or higher license. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>TO APPLYYou must complete a Maryland Department of Transportation (MDOT) application (Form MJ-45) to be considered for this recruitment. Resumes may not be substituted for the application. It is essential that the application is filled out completely and accurately, listing all relevant experience in detail and addressing the specific requirements shown above. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for within MDOT, one of the Transportation Business Units, or the Authority.If you have held more than one (1) position at the same employer, please list each position that you held and the length of time that you held each position.NOTE: If you submit your application online you must attach your complete driving record, or your application will not be considered for this position. Applications not completely filled out will not be considered. The selected candidate may be subject to background and reference checks. Employees are subject to the State Substance Abuse Policy to include possible drug testing.Applications must be completed and submitted online by registering at https://www.governmentjobs.com/careers/mdotmd. Make sure you meet the minimum and selective qualifications and follow the instructions on MDOT's Online Employment Center website.For general questions, please contact the Office of Recruitment and Examinations at (410) 767-3860.Applicants with degrees granted outside of the United States will be required to provide a written evaluation of education documentation by a credentialing organization such as: International Credential Evaluation (WES), https://www.wes.org/.The incumbent in this position will be a member of a covered bargaining unit.Reasonable accommodations for persons with disabilities will be provided as requested.The Maryland Department of Transportation is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees; all sponsorship fees must be assumed by the potential employer.TTY call 711TTY Users May Also Call Their Telecommunications Relay ServiceThe MDOT MTA is an Equal Opportunity Employer. MDOT MTA Does Not Discriminate Based On: Age, Ancestry, Color, Creed Gender Identity or Expression, Genetic Information, Marital Status, Mental or Physical Disability, National Origin, Race, Religious Affiliation, Belief or Opinion, Sex or Sexual Orientation.Issue Date: 04/05/22"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 5,
    "companyName": "",
    "jobkey": "03f11c1f44419edc",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Maryland Department of Transportation State Highway Administration (RE-OPEN)Senior Land Survey Area Engineer (Transportation Engineer V)Grade 19 (2706) SP# 22-60-08*THOSE WHO HAVE ALREADY APPLIED NEED NOT REAPPLY* YOU MUST APPLY ONLINE TO BE CONSIDERED FOR THIS POSITIONhttp://www.governmentjobs.com/careers/mdotmd THE RECONSIDERATION PERIOD FOR THIS RECRUITMENT IS THREE (3) BUSINESS DAYS The Maryland Department of Transportation State Highway Administration's (MDOT SHA) Office of Highway Development, Plats and Survey Division (Baltimore City) is recruiting for a Senior Land Survey Area Engineer (Transportation Engineer V) position. This position is open to anyone who meets the minimum and selective qualifications listed below. This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this MDOT SHA position or function only. You will need to reapply for any future recruitment conducted for this job classification.The Senior Land Survey Area Engineer will perform the duties of a Senior Engineer/Project Manager in the Plats &amp; Survey Division (PSD), is also responsible for full project management of all geomatics engineering services required for projects that have been assigned to this position by PSD management. These duties will include assigning and managing geomatics engineering tasks performed by Consultant Engineering firms under contract with the Maryland Department of Transportation State Highway Administration’s (MDOT SHA) Office of Highway Development (OHD). This position is the sole point of contact for each of their customers for geomatics services required for each project being performed by consultants and/or in-house specialist. These tasks may include, but are not limited to the following types of surveys: Geodetic, conventional topographic, hydraulic cross-section, as-built, photogrammetric and LiDAR, cadastral (including boundary and right of way), stake out services (construction, right of way, Board of Public Works review, and Office of Real Estate sales), plat preparation, CADD services, and subsurface utility designation services (SUE). This position will also provide leadership and management of the Plats &amp; Surveys Division’s field crews and consultant crews during field operations. This position will solve problems in the field as well as determining the most expeditious and cost-effective manner to perform the various geomatics engineering work required to meet the needs of each transportation project. This position will evaluate PSD staff via the annual efficiency ratings and the consultant firms under contract with OHD via the annual performance review.MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits Guide. \"The Maryland Department of Transportation State Highway Administration (MDOT SHA) has been named Training Magazine’s Training APEX Awards for the third consecutive year.\" \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFICATIONS:</b> EDUCATION: Possession of a bachelor's degree in engineering from an accredited college or university. EXPERIENCE: Five (5) years of experience in professional engineering. SELECTIVE QUALIFICATIONS: Two and one half (2 ½) years of the required experience must involved performing geomatics engineering duties and/or land surveying services under the direction and/or supervision of a licensed land surveyor.This statement contains a selective qualification, which is more focused in scope than the minimum qualifications for this classification. Selective qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skill, or ability).PREFERRED QUALIFICATIONS: The ideal candidate will possess the following: Experience working with algebra, geometry and trigonometry and their application to establishing baselines of right of way and computing construction stake out computations. Experience researching and interpreting files, field books, various plats, construction drawings, and engineering plans. Knowledge of the operation and application of survey field equipment and survey software, and Microsoft Office 365 programs.NOTES: 1. Additional work experience in professional engineering, or in technical engineering at the journey level or above, may be substituted on a year for year basis for the required education.2. Possession of a master's degree in engineering may be substituted for one year of the non-supervisory experience.3. Persons currently registered as Professional Engineers in the State of Maryland, or in a state with comparable requirements, are considered to have met the education requirements \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>Candidates must possess a motor vehicle operator's license valid in the State of Maryland. All applicants must list their license number and expiration date on the application. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>SPECIAL REQUIREMENTS:</b> Ability to travel overnight and/or extended work hours to oversee and/or manage resources or projects. Ability to work in other geographic areas within the state for extended duration.TO APPLY: All applicants must submit an application online at http://www.governmentjobs.com/careers/mdotmd. Resumes will not be accepted in lieu of completed applications. To receive credit for your work history and credentials you must list the information on the online DTS-1 application form. You may refer to a resume only to expand on information offered in the body of the online DTS-1 application. Applications must be submitted online by the closing date. The selected candidate may be subject to background and reference checks. A conviction is not an automatic disqualification from employment. Bilingual applicants are encouraged to apply. Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. The state of Maryland offers excellent health and leave benefits, 401k benefits, pension plan a free transit program, and advanced education and training opportunities. The incumbent in this position will not be a member of the covered bargaining unit. PLEASE NOTE: The Maryland Department of Transportation State Highway Administration is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). If you have any questions, please contact the Recruitment and Examination Division at: 410-545-5571 Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please call 410-545-5554. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT SHA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Issued Date: 07/15/22 Re-issued date: 10/12/22"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 4,
    "companyName": "",
    "jobkey": "bdbc1af757addc7d",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>OPEN RECRUITMENTOpen Until Filled This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this Maryland Transportation Authority (MDTA) position/function only. All interested persons will need to re-apply for any future recruitment conducted of this classification. The Maryland Transportation Authority (MDTA) owns, operates, and maintains eight major toll facilities comprised of four bridges, two tunnels, and two turnpikes, across the State of Maryland. For 50 years, the MDTA has provided Maryland's citizens and visitors with safe, secure and convenient transportation facilities. We are committed to quality and excellence in customer service, and we rely on our organization's values, traditions and – most importantly – our employees to achieve these goals. Nature of Work: This position is responsible for managing the preservation efforts of all the MDTA's highway and bridge facilities, including the large complex structures. The incumbent in this position is responsible for managing, tracking, assigning, and performing complex remedial engineering for all task assignments to on-call construction contracts. Duties for this position include, but are not limited to, the following: Develops, manages, and maintains the MDTA's asset management program for compliance with federal standards and regulations, including performance metric evaluation and gap identification, resource and risk analysis, life cycle cost analysis, and cost estimating, tracking, monitoring, and control;Conducts engineering and economic analysis to identify the cost-effective and safe sequence of maintenance, repair, rehabilitation, and replacement activities for the development of the Capital and Operating Structures Preservation program and the long-range needs;Oversees field inspections, using a state vehicle, to obtain field measurements and condition assessments to determine appropriate repair priority and scope for defects;Works closely with the MDTA's Capital Planning Division by providing project schedules, updates, budget and capital expenditures, and scope modifications;Responds to urgent and/or emergency events involving the condition of bridges or other structures and assists in making important decisions on the necessary actions;Performs the designs for major and minor structural repair by studying the feasibility and economic constraints of various repair options; and Assists in the rating of consultant Expressions of Interest and Technical Proposals for the purpose of obtaining expertise and manpower to execute Structural Preservation projects and maintenance of the MDTA's system and inspection contracts.Employees in this position will report directly to the Structures Engineering Manager. The current vacancy exists in Baltimore, Maryland at the MDTA Francis Scott Key (FSK) Office of Engineering and Construction Building. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>Possession of a Maryland Professional Engineer license, in the appropriate option, is required. Evidence of license must be presented at the time of appointment. Experience: Two (2) years of experience managing engineering projects as a licensed, professional engineer. ** One year of this experience must have involved managing, leading, or designing bridge engineering projects.*This statement contains a selective qualification, which is more focused in scope than the minimum qualifications for this classification. Selective qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skill or ability). Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one (1) position at the same employer, please list each position that you held and the length of time that you held each position. For education obtained outside the U.S., at the time of application you are required to provide proof of the equivalent American education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). This must be submitted as an attachment with the application of the position in which you are applying. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. An applicant’s current license as a Professional Engineer in a state with comparable requirements acceptable to the Maryland State Board for Professional Engineers, in the appropriate option for which application is made, will be accepted but the applicant must obtain a Maryland Professional Engineer license within twelve (12) months of appointment. Evidence of out of state license must be presented at time of appointment.2. Employees in this classification may be assigned duties which require the operation of a motor vehicle. Employees assigned such duties will be required to possess a motor vehicle operator's license valid in the State of Maryland.Notes: 1. Registration requirements are established under Title 14, Business Occupations and Professions Article of the Annotated Code of Maryland.2. Employees of the Maryland Department of Transportation assigned to especially sensitivelocations or facilities may be required to obtain and maintain a special security badge. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>1. Employees may be subject to emergency recall 24 hours a day and may be required to maintain a reliable communication link (telephone or pager) for the purpose of emergency call back requirements. 2. Eligible applicants may be subject to a background investigation under federal or State laws and regulations. A conviction is not an automatic disqualification to employment. Erroneous, misleading or fraudulent information on an application is sufficient grounds for rejection from the hiring process, removal from the list of eligibles, withdrawal of an offer for employment or immediate discharge. APPLICATION PROCESS: Please apply on-line at https://www.governmentjobs.com/careers/mdotmd. RESUMES CANNOT BE SUBSTITUTED FOR THE ONLINE EMPLOYMENT APPLICATION. Paper applications (Form DTS-1) will not be accepted for this recruitment. NOTES: Please be advised that the State of Maryland is dedicated to a drug-free workplace, and as a result, employees are subject to the State's Substance Abuse Policy to include possible drug testing. Selected candidate(s) may be subject to background and reference checks.The incumbent in this position will not be a member of a covered bargaining unit. The Maryland Transportation Authority is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDTA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Reasonable Accommodations for persons with disabilities will be provided upon request. Appropriate auxiliary aids and services for qualified individuals with disability will be provided upon request. Please notify us in advance. MD Relay Service Number 1-800-735-2258 (TTY Number: 711). Bilingual applicants are encouraged to apply. Issue Date: 09/01/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 3,
    "companyName": "",
    "jobkey": "14a92f4e3a567b21",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>**Open to All Qualified Candidates**EXECUTIVE SERVICEThis position serves at the pleasure of the Appointing AuthorityThe Maryland Transportation Authority (MDTA) owns, operates, and maintains eight major toll facilities comprised of four bridges, two tunnels, and two turnpikes, across the State of Maryland. For 50 years, the MDTA has provided Maryland's citizens and visitors with safe, secure and convenient transportation facilities. We are committed to quality and excellence in customer service, and we rely on our organization's values, traditions and – most importantly – our employees to achieve these goals. The MDTA is seeking a self-motivated and enthusiastic Deputy Director of Environment, Safety and Risk Management, Asset Control and Damage Recovery (OESRM/ACDR). This position is a critical part of MDTA's Management Team and is responsible for assisting the Director of OESRM/ACDR with providing direction and guidance to OESRM/ACDR staff and the MDTA relative to the following: Environmental - Management, oversight, and the implementation of a comprehensive environmental compliance program to ensure that all MDTA facilities as well as MDTA projects comply with applicable federal and state environmental laws, regulations, and internal policies.Safety and Risk Management – Oversight of the MDTA's Safety and Risk Management Program to include assessment of potential risk liabilities; create, implement, and manage programs to control liability; work with senior management in the development of programs for their area to reduce risks and potential losses and the evaluation of workplace safety.Asset Control - Oversight of the development of inventory control practices, procedures, training, and accountability protocols.Damage Recovery - Management of the investigation of damaged MDTA assets caused by third parties and the recovery of repair costs from insurance providers.Typical duties include, but are not limited to: Direct supervision to a team of managers and acts for the Director of OESRM/ACDR in their absence, or as designatedDevelopment and implementation of safety and risk management programs; Management and oversight of the creation, implementation and modification of policies, procedures, and operating guidelines to comply with applicable environmental regulations and laws;Oversight of agency-wide physical asset control audits;Oversight of the management of surplus inventory via public auction, or destruction as well as annual development of Property and Liability insurance coverages for MDTA infrastructure;Developing and implementing a systematic approach to minimizing and mitigating safety risks; andAligning environmental, safety/risk management programs, and asset control/damage recovery programs with strategic initiatives established by MDOT.The Deputy Director of OESRM/ACDR must be a highly competent communicator, both orally and written; that has demonstrated experience in developing long-term strategic plans for both OESRM and ACDR as it relates to MDTA's operations and activities.The selected candidate will receive direct supervision from the Director of OESRM/ACDR. This position is located in Baltimore, Maryland. Hybrid telework schedules may be available for this position. MDTA employees are offered a generous benefits package including: a minimum of 10 paid holidays, a minimum of 27* days of leave annually (personal, vacation, and sick), access to the State Pension System, deferred compensation plans, excellent health, dental, and vision plans, and more! *May be prorated based upon start date. \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>PREFERRED QUALIFICATIONS Education:</b> Possession of a bachelor’s degree from an accredited college or university in Safety Management, Risk Management, Environmental Science, or other relevant field.Experience: Seven years of demonstrated experience in environmental or safety/risk management disciplines. Three years of this experience should include one or more of the following: the supervision of other employees, overseeing and coordinating the general operations of a unit, applying rules and regulations, and exercising responsibility for the development of policies and/or procedures.The ideal candidate will possess: Knowledge and experience in interpreting, applying and ensuring compliance with environmental, safety/risk management, asset control/damage recovery laws and regulations;Strong interpersonal and communication skills, including demonstrated ability to build trusting working relationships with people from a wide range of constituencies in a diverse work environment to ensure successful outcomes;Demonstrated experience in effectively supervising, developing, and mentoring a professionally diverse team;Strong presentation, training, and facilitation skills with the ability to engage individuals with varying degrees of experience in examining and addressing issues of safety/risk management compliance, environmental compliance, and asset control compliance;Excellent project and time management skills, to ensure that multiple tasks and other work duties are completed in a timely manner; andTransformational leadership, flexibility, adaptability, and the capacity to work in a dynamic work environment.Your placement on an eligible list may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part-time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one (1) position at the same employer, please list each position that you held and the length of time that you held each position. Notes/Substitutions: 1. Candidates may substitute U.S. Armed Forces military service experience as defined under the Preferred Qualifications may be substituted for the required experience on a year-for-year basis. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>Applicants must possess a Class C driver's license valid in the State of Maryland. Applicants must list the license number and date of expiration on the application. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>APPLICATION PROCESS:</b> Please apply on-line at https://www.governmentjobs.com/careers/mdotmd. RESUMES CANNOT BE SUBSTITUTED FOR THE ONLINE EMPLOYMENT APPLICATION. Paper applications (Form DTS-1) will not be accepted for this recruitment. NOTES: Please be advised that the State of Maryland is dedicated to a drug-free workplace, and as a result, employees are subject to the State's Substance Abuse Policy to include possible drug testing. Selected candidate(s) may be subject to background and reference checks. The incumbent in this position will not be a member of a covered bargaining unit.For education obtained outside the U.S., at the time of application you are required to provide proof of the equivalent American education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). This must be submitted as an attachment with the application of the position in which you are applying. The Maryland Transportation Authority is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDTA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. MDOT has various careers for people of all experiences, backgrounds, and abilities who come together to contribute to one mission - connecting our customers to life’s opportunities. Join us in serving our Maryland residents, visitors, and businesses! Reasonable Accommodations for persons with disabilities will be provided upon request. Appropriate auxiliary aids and services for qualified individuals with disability will be provided upon request. Please notify in advance. MD Relay Service Number 1-800-735-2258 (TTY Number: 711). Bilingual applicants are encouraged to apply. Issue Date: 10/20/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 2,
    "companyName": "",
    "jobkey": "94fc315991a86f5f",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Maryland Department of Transportation State Highway Administration Assistant Division Chief (Transportation Design Engineer VI)Grade 22 (7666) SP# 22-52-03YOU MUST APPLY ONLINE TO BE CONSIDERED FOR THIS POSITION http://agency.governmentjobs.com/mdotmdTHE RECONSIDERATION PERIOD FOR THIS RECRUITMENT IS THREE (3) BUSINESS DAYS The Maryland Department of Transportation State Highway Administration's (MDOT SHA) Office of Traffic &amp; Safety (OOTS) Traffic Engineering Design Division (TEDD) is currently recruiting for an Assistant Division Chief (Transportation Design Engineer VI) in Anne Arundel County. This position is open to anyone who meets the minimum and selective qualifications listed below. This is a position specific recruitment. The resulting list of eligible candidates will be used to fill this vacancy. You will need to reapply for any future recruitment conducted for this job classification.Job Duties: The Assistant Division Chief will assist the Chief of the Traffic Engineering Design Division in the supervision, management, direction and administration of the TEDD. Duties will include supervision of in-house licensed professionals, consultant engineers and non-licensed engineers who manage traffic control design and ITS projects and programs. These programs include but are not limited to the Tourist Area and Corridor Signing Program, Ag-Tourism Program and Lighting Emitting Diodes (LED) roadway lighting program. This position will oversee the research and development of engineering standards that meet federal and state policies. The Assistant Division Chief will also ensure all elements are within current standards, guidelines and policies mandated by the Manual on Uniform Traffic Control Devices (MUTCD), American Association of Highway and Transportation Officials (AASHTO), Institute of Transportation Engineers (ITE), Americans with Disabilities Act (ADA), National Electrical Manufacturer’s Association (NEMA), National Electric Code (NEC), National Electric Safety Code (NESC), Code of Maryland Regulations (COMAR) and Maryland Vehicle Law. The position is responsible for guiding, mentoring and supervising team leaders in both technical and professional development. MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits Guide. \"The Maryland Department of Transportation State Highway Administration (MDOT SHA) has been named Training Magazine’s Top 100 for the second consecutive year.\" \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Minimum Qualification:</b> Possession of a Maryland Professional Engineer license, in the appropriate option, is required. Evidence of license must be presented at the time of appointment. Experience: Two (2) years of experience managing engineering projects as a licensed, professional engineer.Selective Qualifications: Three (3) years of professional engineering experience in the design or review of Traffic control design or Program Management as it relates to Traffic engineering. One (1) year of experience must have been in the direct supervision or management of engineering staff. This statement contains a selective qualification, which is more focused in scope than the minimum qualifications for this classification. Selective qualifications are utilized when the position requires a specific or additional bona fide occupational qualification (i.e. knowledge, skill or ability). Notes: An applicant's current license as a Professional Engineer in a state with comparable requirements acceptable to the Maryland State Board for Professional Engineers, in the appropriate option for which application is made, will be accepted but the applicant must obtain a Maryland Professional Engineer license within twelve (12) months of appointment. Evidence of out of state license must be presented at time of appointment.Preferred Qualification: The ideal candidate should have experience in one or more of the following: Proficiency in the design and review of traffic control device plans and computations of major/complex and areawide projects.Experience in direct supervision or management of engineering staffExperience in managing project/program scope, budget, and schedule for multiple programs, solving technical problems and managing teamsSelf-motivated with the ability to work independently.Knowledge of professional transportation engineering principles, federal/state traffic engineering regulations, policies, standards and guidelines.Excellent internal/external customer service abilities and interpersonal skills.Good written and oral communication skills. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>\n<b>None.TO APPLY:</b> All applicants must submit an application online at http://www.governmentjobs.com/careers/mdotmd (use of this option allows the application to be saved). Resumes will not be accepted in lieu of a completed application. To receive credit for your work history and credentials you must list the information in the online DTS-1 application form. You may refer to a resume only to expand on information offered in the body of the online DTS-1 application. Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one (1) position at the same employer, you must list each position that you held, the length of time that you held each position, and the corresponding duties. Applications must be submitted online by the closing date. If you have any questions, please contact the Office of Administration at the number(s) listed below: 410-545-5554The selected candidate may be subject to background and reference checks. A conviction is not an automatic disqualification from employment. Bilingual applicants are encouraged to apply. The state of Maryland offers excellent health and leave benefits, 401k benefits, pension plan, a free transit program, and advanced education and training opportunities. Please Note: The Maryland Department of Transportation State Highway Administration is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer. Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please call at 410-545-5554.Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). The incumbent in this position will not be a member of a covered bargaining unit. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT SHA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Issue Date: 02/28/22"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 1,
    "companyName": "",
    "jobkey": "a0d0b2a894a9517e",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>OPEN RECRUITMENTOpen Until FilledIf you have ever taken a flight from BWI Thurgood Marshall Airport; renewed your Maryland driver’s license; traveled to an Orioles game on the Light Rail; embarked on a cruise from the Port of Baltimore; received roadside assistance from CHART Emergency Patrol; reduced your commute time by using one of Maryland’s toll roads; or applied for Minority Business Enterprise (MBE) certification, then you have experienced some of the superb services provided by the Maryland Department of Transportation (MDOT). MDOT has various careers for people of all experiences, backgrounds, and abilities who come together to contribute to one mission—connecting our customers to life’s opportunities. Join us in serving our Maryland residents, visitors, and businesses! This is the journey level of skilled trade work as an Electrician. The employee performs work in accordance with all applicable local, state, and federal regulations and standard practices or rules governing the electrical trade. Examples of work include but are not limited to: installing, repairing and maintaining electrical equipment such as ballasts, cable, conduit boxes, conduit tubing, control systems, coils, electronic signage, fans, fluorescent and incandescent units, fuses, generators, high mast light poles, outlets, panels, relays, switches, transformers, wiring and roadway lighting systems, and emergency standby systems. Work may include other maintenance duties as assigned. This is maintenance work requiring physical exertion performed either outdoors under all weather conditions or inside an MDOT building. On some assignments, employees may be required to move objects weighing over 50 pounds and may also be required to work on equipment located on high poles or other elevated locations, and/or perform their job in cramped quarters in buildings or underground. Employees in these classes are considered essential employees and are subject to emergency call back procedures, twenty-four hours a day, as may be required to maintain continuous operation of a facility. Employees may be required to work rotating shift work, to include evenings, nights, weekends, and holidays. The current vacancy exists within the Maryland Transportation Authority (MDTA) at the Baltimore Harbor Tunnel in Baltimore, Maryland. The Maryland Transportation Authority (MDTA) owns, operates, and maintains eight major toll facilities comprised of four bridges, two tunnels, and two turnpikes across the State of Maryland. For 50 years, the MDTA has provided Maryland's citizens and visitors with safe, secure, and convenient transportation facilities. The eligible list produced from this recruitment may be utilized for future Skilled Trade Specialist II Electrician openings within MDOT. MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>MINIMUM QUALIFICATIONS:</b> Education: Graduation from a standard high school or possession of a high school equivalency certificate. Experience: Three (3) years of experience performing skilled trade work in the electrical trade. Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part-time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. NOTES: 1. Additional work experience performing skilled trades as defined above may be substituted on a year-for-year basis for the required education. 2. A certificate from a vocational technical school with a major in one or more of the skilled trades as defined above may be substituted for one year of the required general experience. 3. Candidates may substitute U.S. Armed Forces military service experience as a non-commissioned officer in utilities repair classifications or construction and engineering specialty codes in the skilled trades as defined above field of work, on a year-for-year basis for the required experience. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>1. Candidates appointed to positions in this classification are assigned duties that require the operation of motor vehicles. Employees are required to possess a motor vehicle operator's license valid in the State of Maryland. All applicants must list their license number and expiration date on the application. 2. During the probationary period, employees may be required to obtain and maintain a Class A or Class B Commercial Driver's License (CDL) valid in the State of Maryland, depending on the type of equipment operated. 3. Employees at the Maryland Aviation Administration must have or obtain an Airfield Operators Permit in accordance with the Code of Maryland Regulations 11.03.01.04, Control of Vehicular Traffic on the Air Operations Area, prior to permanent appointment. 4. The employing administration may require employees to satisfy its agency training and certification program requirements to obtain and maintain permanent status in this classification. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>1. Applicants who are considered for work at the Maryland Aviation Administration are subject to an extensive pre-employment security background check as required by the Federal Aviation Administration, Federal Aviation Regulation Part 107. 2. Employees must be willing and available for duty at such hours, day or night, as may be required to maintain continuous operation of a facility and are subject to call-in. 3. Employees are required to maintain a reliable communication link for emergency call back requirements. 4. Employees who work with, or may be exposed to, hazardous materials such as asbestos, lead-based paint or chromium, may be required to undergo periodic medical testing and may be required to pass hazardous materials training and can wear a respirator. 5. Applicants may be required to demonstrate the ability to perform maintenance work on high structures and in cramped quarters. 6. Employees in this classification are considered \"Essential Employees\" and must sign and agree to all policies and procedures relating to \"Essential Employee\" status. 7. Candidates will be subject to pre-employment drug testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs. 8. Employees in this classification are subject to substance abuse testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs. TO APPLY: You must complete an MDOT employment application (DTS-1) online to be considered for this recruitment. RESUMES CANNOT BE SUBSTITUTED FOR THE MDOT EMPLOYMENT APPLICATION. No paper applications will be accepted. Selected candidates may be subject to background and reference checks. You may apply online at: https://www.governmentjobs.com/careers/mdotmd. Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please notify in advance. MD Relay Service Number (711). Bilingual applicants are encouraged to apply. The Maryland Department of Transportation is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees; all sponsorship fees must be assumed by the potential employer. Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). The incumbent in this position may be a member of a covered bargaining unit. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation. Issue Date: 10/24/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 16,
    "position": 0,
    "companyName": "",
    "jobkey": "3105f4d9d172ca91",
    "jobTitle": "",
    "jobDescription": "JOB \n<br>Executive Service Position *This position serves at the pleasure of the Appointing Authority* Data Governance &amp; Strategy Section Chief (Administrator VI)YOU MUST APPLY ONLINE TO BE CONSIDERED FOR THIS POSITIONhttp://www/governmentjobs.com/careers/mdotmdThe Maryland Department of Transportation State Highway Administration's (MDOT SHA) is seeking to fill an executive service position as a Data Governance &amp; Strategy Section Chief (Administrator VI) in the Office of Information Technology (OIT) in Baltimore City. This position is open to anyone who meets the preferred qualifications below.The Data Governance and Data Strategy Section Chief will be responsible for the day-to-day activities and initiatives of the MDOT SHA Data Office and will be responsible for improving the quality assurance of information managed and delivered to both our internal and external customers. This position will oversee a team that develops, implements, revises, applies, recommends, and oversees the application of agency data policies, standards, and procedures for enterprise data governance. This team manages a quality assurance framework in business and functional areas to accomplish the required level of data consistency, quality, and protection to meet overall MDOT SHA data needs and requirements. Additionally, this position will oversee the coordination of staff, administrators, and upper-level management to implement and enforce data regulations and policies while researching and recommending new technology solutions to support program initiatives.This position may allow a hybrid work schedule, including telework and on-site work hours.MDOT offers a generous and competitive benefits package. You can learn about our amazing benefits here: MDOT Benefits Guide. \"The Maryland Department of Transportation State Highway Administration (MDOT SHA) has been named Training Magazine’s Training APEX for the third consecutive year.\" \n<br>\n<br> EXAMPLE OF DUTIES \n<br>\n<b>Preferred Qualifications:</b> Education: Possession of a bachelor's degree from an accredited college or university. Experience: Six (6) years of experience in administrative or professional work. Two (2) years of this experience must have involved one or more of the following: the supervision of other employees, overseeing and coordinating the general operations of a unit, applying rules and regulations, or exercising responsibility for the development of policies or procedures. The ideal candidate will possess the following: - Familiarity with the Data Management Body of Knowledge (DAMA-DMBOK)- Excellent oral and written communication skills- Able to function independently and as a member a team Notes: 1. Additional experience in administrative or professional work may be substituted on a year-for-year basis for the required education. 2. Additional graduate level education at an accredited college or university may be substituted at the rate of 30 semester credit hours on a year-to-year basis for the required general experience. 3. Candidates may substitute U.S. Armed Forces military service experience involving staff work related to the administration of rules, regulations, policies, procedures, and processes, or overseeing or coordinating unit operations or functioning as a staff assistant on a year-for-year basis for the required education and experience. \n<br>\n<br> MINIMUM QUALIFICATIONS \n<br>None. \n<br>\n<br> SUPPLEMENTAL INFORMATION \n<br>\n<b>TO APPLY:</b> All applicants must submit an application online at http://www.governmentjobs.com/careers/mdotmd (use of this option allows the application to be saved). Resumes will not be accepted in lieu of a completed application. To receive credit for your work history and credentials you must list the information in the online DTS-1 application form. You may refer to a resume only to expand on information offered in the body of the online DTS-1 application.Consideration for employment may be based solely on the contents of your application; therefore, it is essential that you provide complete and accurate information. Please include all relevant experience on your application. This includes, but is not limited to, full or part time, volunteer, military, acting capacity, or any other experience that is relevant to the position you are applying for. If you have held more than one (1) position at the same employer, you must list each position that you held, the length of time that you held each position, and the corresponding duties.Applications must be submitted online by the closing date.If you have any questions, please contact the Office of Administration at the number(s) listed below: 410-545-5554The selected candidate may be subject to background and reference checks. A conviction is not an automatic disqualification from employment. Bilingual applicants are encouraged to apply.The state of Maryland offers excellent health and leave benefits, 401k benefits, pension plan, a free transit program, and advanced education and training opportunities.Please Note: The Maryland Department of Transportation State Highway Administration is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer.Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please call at 410-545-5554.Applicants who have education obtained outside of the U.S. will be required to provide proof of the equivalent U.S. education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Services (http://www.naces.org) or World Education Services: International Credential Evaluation (https://www.wes.org/). The incumbent in this position will not be a member of a covered bargaining unit. WE ARE AN EQUAL OPPORTUNITY EMPLOYER. MDOT SHA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation.Issue Date: 11/18/2022"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 14,
    "companyName": "",
    "jobkey": "8c531c51f721dab7",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>Current Fellows and Experienced Neurologists: Kaiser Permanente in the Mid-Atlantic region is seeking a neurologist with sub specialty training in Neuroimmunology and epitleptologist. The opportunity will be located in our Suburban Maryland region. This positions offers a collegial work environment with quick access to primary care and specialist physician consults. The candidate must be board eligible or certified in Neurology and can obtain active Maryland, DC and Virginia medical licenses upon his/her date of hire. Work visa sponsorship is available for eligible applicants.</p> \n <p> MAPMG offers a satisfying practice without the hassles of running an office and freedom from insurance billing. When you join the Mid-Atlantic Permanente Medical Group (MAPMG), you'll be able to get more out of your life and your career. As a Physician owned and managed multi-specialty group with 1700 Physicians serving over 800,000 patients, we know firsthand what it takes to advance professionally and thrive personally. We have an integrated EMR system, which includes PACS (with remote access) and an excellent team approach to providing care. Our physicians can expect extremely competitive compensation, 100% paid health and dental insurance premiums. Multiple retirement options are offered, including a 401k (5% salary contribution) and vested pension plan after 5 years of service.</p>\n <p><br> Living and working in the Mid-Atlantic Region offers you all of the convenience of two major metropolitan areas with easy access to the Chesapeake Bay, Shenandoah Mountains, and Atlantic Ocean. The region is great for families: the local public schools are considered among the finest in the country. Best of all, you are just minutes away from the cultural, historical, and entertainment venues of our nation's capital.</p> \n <p> Here are just some of the reasons why our more than 1700 physicians joined the Mid-Atlantic Permanente Medical Group:</p> \n <ul> \n  <li>physician led and driven practice</li> \n  <li>multi-specialty support</li> \n  <li>collegial atmosphere</li> \n  <li>affiliation with top hospitals</li> \n  <li>generous benefits</li> \n  <li>shareholder opportunities</li> \n  <li>reasonable, predictable schedules</li>\n </ul>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 13,
    "companyName": "",
    "jobkey": "35e2bb683f2b0190",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>The Mid-Atlantic Permanente Medical Group, PC (MAPMG) located throughout the metropolitan Baltimore and Washington, D.C. areas is currently interviewing for <b>Fellowship trained Radiologist</b> to support our <b>Baltimore service area.</b> The Kaiser Permanente medical care program is the largest and most experienced integrated health-care system in the country. Established over 60 years ago, our programs continue to receive national awards of excellence.</p> \n <p> MAPMG is a physician-owned and managed multi-specialty group with over 1700 physicians serving over 780,000 patients at 34 medical centers. MAPMG offers a satisfying practice without the hassles of running an office and freedom from insurance billing.</p> \n <p> We offer a competitive salary (based on MGMA data), exceptional benefits, paid occurrence malpractice insurance, and the opportunity to attain shareholder status in two years. 100% paid health and dental insurance premiums for themselves and their eligible dependents, as well as 4 weeks of vacation and 9 paid holidays. Multiple retirement options are offered, including a 401k (5% salary contribution) and vested pension plan after 5 years of service.</p> \n <p> Living and working in the Mid-Atlantic Region offers you all of the convenience of two major metropolitan areas with easy access to the Chesapeake Bay, Shenandoah Mountains, and Atlantic Ocean. The region is great for families: the local public schools are considered among the finest in the country. Best of all, you are just minutes away from the cultural, historical, and entertainment venues of our nation's capital.</p> \n <p><b> Requirements</b> Candidate must be B/E or B/C and have or can obtain active Virginia, DC and Maryland Medical Licenses. Work visa sponsorship is available for eligible applicants.</p> \n <p> #DOX-1 #HECRH</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 12,
    "companyName": "",
    "jobkey": "431b4b835afff7a0",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>The Mid-Atlantic Permanente Medical Group (MAPMG) proudly provides the highest quality integrated care for over 800,000 members in Virginia, Maryland, and the District of Columbia. We invite applications for a specialist in <b>Nephrology</b> at our <b>Timonium, MD location</b>.</p> \n <p> In collaboration with the Kaiser Foundation Health Plan of the Mid-Atlantic States, we provide high-quality, patient-centered health care. Through this partnership, our physicians are part of an industry-leading health care delivery model, having access to advanced technological tools and receiving comprehensive practice support.</p> \n <p> MAPMG physicians are salaried, without the pressures of alternative payment models or fee-for-services. Our members have easy access to specialists and medical records, thus allowing you to treat the whole patient.</p> \n <p><b> What You Can Expect:</b></p> \n <ul> \n  <li>3 physician Nephrology Team</li> \n  <li>Extensive Case Management support for Advanced CKD and ESRD patients</li> \n  <li>Pharmacist support for ESA management</li> \n  <li>Call 1:3</li> \n  <li>Covering 2 hospitals</li> \n  <li>Conveniently located 24hour Urgent Care in the office building</li> \n  <li>Internal Peritoneal dialysis unit</li> \n  <li>Opportunities for teaching and research available</li> \n </ul> \n <p><b>Minimum Requirements:</b></p> \n <ul> \n  <li>MD or DO</li> \n  <li>Board Certified or Eligible in Nephrology</li> \n  <li>Currently licensed or able to obtain licenses in the District of Columbia, Maryland, and Virginia</li> \n  <li>Work visa sponsorship is available for eligible applicants</li> \n </ul> \n <p><b>MAPMG Physicians:</b></p> \n <ul> \n  <li>Practice patient-centered, culturally competent medical care</li> \n  <li>Communicate thoughtfully (listen, educate, advocate)</li> \n  <li>Lead with integrity</li> \n  <li>Value teamwork</li> \n  <li>Are transparent and honest</li> \n  <li>Go “above and beyond” for their patients</li> \n </ul> \n <p><b>We Provide You:</b></p> \n <ul> \n  <li>Competitive compensation</li> \n  <li>Comprehensive benefits include 100% employer-funded medical and dental insurance premiums, a pension plan and 401(k), life insurance, and annual leave</li> \n  <li>Complete professional liability coverage provided at no cost, 100% reimbursement for obtaining and maintaining board certification, continuing medical education reimbursement, and in-house CME opportunities</li> \n  <li>Clinical support team</li> \n  <li>A concierge service that works directly with you to apply for all required state, CDS, and DEA licenses</li> \n </ul> \n <p><b>Equity, Inclusion, and Diversity:</b></p> \n <p> MAPMG continuously works to identify and mitigate healthcare inequities, and that starts with providing an inclusive, supportive environment for our physicians. We encourage applicants of any race, color, religion, sex, sexual orientation, gender identity, or national origin who value diversity and will commit to practicing culturally competent healthcare.</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 11,
    "companyName": "",
    "jobkey": "ce8ee1f72877b14c",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>The <b>Mid-Atlantic Permanente Medical Group, PC (MAPMG)</b> located throughout the metropolitan Baltimore and Washington, D.C. areas is currently interviewing for a general <b>Gastroenterologist (no ERCP/EUS required)</b> to join our large, multi-specialty group at our <b>Baltimore Medical Center</b>. This is a 32 hour/week position with full benefits, caring for patients at our South Baltimore medical center. Enjoy access to state of the art endoscopy equipment, freedom from running an office or calling in prior authorizations! Work in a collegial environment alongside a fully integrated team that closely collaborates with in-house surgical specialties. Once fully staffed, call will be 1:6 with rounding duties exclusively located in Baltimore-based hospitals. Board certified or eligible, and the ability to obtain active DC, Maryland, and Virginia medical licenses are required. Work visa sponsorship is available for eligible applicants. <b>Now offering a $150,000 forgivable loan as a new hire incentive!</b></p> \n <p> The Kaiser Permanente medical care program is the largest and most experienced integrated health-care system in the country. Established over 50 years ago, our programs continue to receive national awards of excellence. The Mid-Atlantic Permanente Medical Group is a physician-owned and managed multi-specialty group with over 1700 physicians serving over 800,000 patients at 33 medical centers in the Mid-Atlantic region.</p> \n <p> We offer a <b>competitive salary and an amazing benefits package including a pension program. </b>Living and working in the Mid-Atlantic Region offers you all of the convenience of two major metropolitan areas with easy access to the Chesapeake Bay, Shenandoah Mountains, and Atlantic Ocean. The region is great for families: the local public schools are considered among the finest in the country. Best of all, you are just minutes away from the cultural, historical, and entertainment venues of our nation's capital. Here are just some of the reasons why our 1700 physicians joined the Mid-Atlantic Permanente Medical Group:</p> \n <ul> \n  <li>physician-led and driven practice</li> \n  <li>state-of-the art medical centers with the latest in GI equipment</li> \n  <li>built in referral base from large multi-specialty group</li> \n  <li>multi-specialty support</li> \n  <li>collegial atmosphere</li> \n  <li>reasonable, predictable schedules</li> \n </ul> \n <p>#DOX-3 #HECRS</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 10,
    "companyName": "",
    "jobkey": "5ce4ed0f88ed89ad",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>The Mid-Atlantic Permanente Medical Group, PC (MAPMG) is currently interviewing for a BE/BC <b>Anesthesiologist</b> to join our <b>South Baltimore</b> practice. The selected candidate will oversee general cases at our medical centers and affiliated hospitals in the surrounding Baltimore area. Candidates must be eligible for Maryland, DC and Virginia medical licensure. Board Certification and 2 years of experience is strongly preferred. New residents and fellows are encouraged to apply. Work visa sponsorship is available for eligible applicants.</p> \n <p><b> Now Offering a $150,000 Forgivable Loan!</b></p> \n <p> We offer a competitive salary (based on MGMA data), exceptional benefits and retirement packages, paid occurrence malpractice insurance, and the opportunity to attain shareholder status in two years .New residents and fellows are encouraged to apply.</p> \n <p> Living and working in the Mid-Atlantic Region offers you all of the convenience of two major metropolitan areas with easy access to the Chesapeake Bay, Shenandoah Mountains, and Atlantic Ocean. The region is great for families: the local public schools are considered among the finest in the country. Best of all, you are just minutes away from the cultural, historical, and entertainment venues of our nation's capital.</p> \n <p> Here are just some of the reasons why our physicians joined the Mid-Atlantic Permanente Medical Group:</p> \n <ul> \n  <li>physician-led and driven practice</li> \n  <li>multi-specialty support</li> \n  <li>collegial atmosphere</li> \n  <li>affiliation with top hospitals</li> \n  <li>generous benefits</li> \n  <li>shareholder opportunities</li> \n  <li>reasonable, predictable schedules</li> \n </ul> \n <p>#DOX-2 #HECPM</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 9,
    "companyName": "",
    "jobkey": "4a2e7e9d3043ba63",
    "jobTitle": "",
    "jobDescription": "<div>\n <div>\n  https://www.governmentjobs.com/careers/mdotmd/jobs/3512623/plumber-skilled-trade-specialist-ii?department[0]=Maryland%20Aviation%20Administration&amp;sort=PositionTitle%7CAscending&amp;pagetype=jobOpportunitiesJobs\n  <br> \n  <br> \n  <b>MARYLAND DEPARTMENT OF TRANSPORTATION</b>\n  <br> \n  <b>invites applications for the position of:</b>\n  <br> \n  <br> Plumber (Skilled Trade Specialist II)\n  <br> \n  <b>SALARY:</b> | $37,785.00 - $60,724.00 Annually\n  <br> \n  <br> \n  <b>OPENING DATE:</b> | 06/27/22\n  <br> \n  <b>CLOSING DATE:</b> | 07/11/22 11:59 PM\n  <br> \n  <b>DESCRIPTION:</b>\n  <br> \n  <br> \n  <b>Open Recruitment</b>\n  <br> \n  <b>Position Specific Recruitment</b>\n  <br> \n  <br> \n  <i>This is a position specific recruitment, open to anyone who meets the minimum and selective qualifications listed below. The resulting list of eligible candidates will be used to fill this position or function only. You will need to reapply for any future recruitment conducted for this job classification.</i>\n  <br> \n  <br> The Maryland Department of Transportation Maryland Aviation Administration (MDOT MAA) is the owner &amp; operator of both BWI Thurgood Marshall and Martin State Airports, serving over 27 million passengers annually. Powered by\n  <b> PERFORMANCE. </b>Inspired by\n  <b> INNOVATION. </b>Fueled by \n  <b>FUN. </b>we are chartering careers to\n  <b> </b>unprecedented Successes, Opportunities\n  <b>, </b>Advancements, Results\n  <b>, </b>and\n  <b> </b>Service. If you’re beginning your career journey or performing at your peak level, we invite you to consider our aviation family for your career. \n  <br> \n  <br> MDOT MAA is currently accepting applications for the position of Plumber (Skilled Trade Specialist II) at the Baltimore/Washington International Thurgood Marshall Airport (BWI Marshall Airport). Employees in this class are required to perform various duties such as: Installing, repairing, and maintaining plumbing and natural gas equipment, piping, valves, and fittings in compliance with the Maryland State and International Plumbing Codes Installing valves and piping from ‘A” to 12”. Installation and repairs to showers, lavatories, water closets, faucets, and urinals, Fitting copper pipes and fittings using assorted flux, solder, and brazing materials Using different types of gases (i.e., map, and acetylene to fit and cut copper and steel pipes). Installing steel, water, natural gas by using power threaders and groves to cut, thread, and grove the ends of the piping; Troubleshooting and repairing sewage ejector pumps, motors, and controls This is maintenance work requiring physical exertion performed either outdoors under all weather conditions or inside an MDOT MAA building. On some assignments, employees may be required to move objects weighing over 50 pounds and may also be required to work on equipment located on high poles or other elevated locations, and/or perform their job in cramped quarters in buildings or underground. Employees in this class are considered essential employees and are subject to emergency call-back procedures, twenty-four hours a day, as may be required to maintain the continuous operation of a facility. Employees may be required to work rotating shift work, including evenings, nights, weekends, and holidays. This position is an emergency essential position. All employees designated as emergency essential are required to be available to work during weather, operational, and/or disaster emergency conditions. Furthermore, this position requires work in a 24- hour facility and you must be available to work any shift as required by the operational needs of the MDOT MAA.\n  <br> \n  <br> \n  <b>This position is located at BWI Marshall Airport in Anne Arundel County, MD. </b>\n  <br> \n  <br> \n  <b>QUALIFICATIONS:</b>\n  <br> \n  <b>Minimum Qualifications:</b>\n </div>\n <ul>\n  <li><b> Education: </b>Graduation from a standard high school or possession of a high school equivalency certificate.</li>\n </ul>\n <div> \n  <br> \n  <b>Experience</b>:\n </div>\n <ul>\n  <li> Three years of experience performing skilled trade work in plumbing.<i> *Two years of this experience must have involved service and repair of various plumbing hardware in the commercial and residential setting including faucets, water heaters, utility sinks, ejector pumps, grease interceptors, troubleshooting leaks, and using drain clearing machinery used in the plumbing trade.</i></li>\n </ul>\n <div>\n  <br> \n  <ul>\n   <li><b><i>This statement contains a Selective Qualification, which is more focused in scope than the Minimum Qualifications for this classification. Selective Qualifications are utilized when the position requires specific or additional bona fide occupational qualifications (i.e., knowledge, skills, or abilities).</i></b></li>\n  </ul>\n  <br> \n  <b> Notes:</b>\n </div>\n <ul>\n  <li> Additional work experience performing skilled trades as defined above may be substituted on a year-for-year basis for the required education.</li>\n  <li> A certificate from a vocational-technical school with a major in one or more of the skilled trades as defined above may be substituted for one year of the required general experience.</li>\n  <li> Candidates may substitute U.S. Armed Forces military service experience as a non-commissioned officer in utility repair classifications or construction and engineering specialty codes in the skilled trades as defined above the field of work, on a year-for-year basis for the required experience.</li>\n </ul>\n <div> \n  <br> \n  <b>LICENSES &amp; CERTIFICATIONS:</b>\n </div>\n <ul>\n  <li> Candidates appointed to positions in this classification are assigned duties that require the operation of motor vehicles. Employees are required to possess a motor vehicle operator's license valid in the State of Maryland. <b>All applicants must list their license number and expiration date on the application.</b></li>\n  <li> During the probationary period, employees may be required to obtain and maintain a Class A or Class B Commercial Driver's License (CDL) valid in the State of Maryland, depending on the type of equipment operated.</li>\n  <li> Employees at the Maryland Aviation Administration must have or obtain an Airfield Operators Permit in accordance with the Code of Maryland Regulations 11.03.01.04, Control of Vehicular Traffic on the Air Operations Area, prior to permanent appointment.</li>\n  <li> The employing administration may require employees to satisfy its agency training and certification program requirements to obtain and maintain permanent status in this classification.</li>\n </ul>\n <div>\n  <br> \n  <b> ADDITIONAL INFORMATION:</b>\n </div>\n <ul>\n  <li> Applicants who are considered for work at the Maryland Aviation Administration are subject to an extensive pre-employment security background check as required by the Federal Aviation Administration, Federal Aviation Regulation Part 107.</li>\n  <li> Employees must be willing and available for duty at such hours, day or night, as may be required to maintain continuous operation of a facility and are subject to call-in.</li>\n  <li> Employees are required to maintain a reliable communication link for emergency call back requirements.</li>\n  <li> Employees who work with, or may be exposed to, hazardous materials such as asbestos, lead-based paint or chromium, may be required to undergo periodic medical testing and may be required to pass hazardous materials training and can wear a respirator.</li>\n  <li> Applicants may be required to demonstrate the ability to perform maintenance work on high structures and in cramped quarters.</li>\n  <li> Employees in this classification are considered \"Essential Employees\" and must sign and agree to all policies and procedures relating to \"Essential Employee\" status.</li>\n  <li> Candidates will be subject to pre-employment drug testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs.</li>\n  <li> Employees in this classification are subject to substance abuse testing in accordance with the Transportation Code of Maryland Regulations 11.02.11, Testing for Illegal Use of Drugs.</li>\n </ul>\n <div>\n  <br> \n  <b> To Apply:</b>\n  <br> \n  <br> \n  <b>****ACCEPTING ONLINE APPLICATIONS ONLY****</b>\n  <br> \n  <b> TO APPLY: You may apply online at </b>https://www.governmentjobs.com/careers/mdotmd to be considered for this recruitment. \n  <b>RESUMES CAN NOT BE SUBSTITUTED FOR THE MDOT EMPLOYMENT APPLICATION. </b>It is essential that the application is filled out completely and accurately, listing all relevant experience in detail and addressing the specific requirements shown above. This includes, but is not limited to, full or part-time, volunteer, military, acting capacity, or any other experience that is relevant to this position. If you have held more than one position at the same employer, please list each position that you held and the length of time that you held each position. \n  <b>Your application must be received by 07/11/2022</b>. Appropriate auxiliary aids and services for qualified individuals with disabilities will be provided upon request. Please notify in advance. MD Relay Service Number (711). Bilingual applicants are encouraged to apply. The selected candidate may be subject to background and reference checks.\n  <br> \n  <b> </b>\n  <br> The Maryland Department of Transportation is not sponsoring new employees in application of the H-1B Visa or providing an extension of an existing H-1B Visa at this time due to budgetary constraints. All applicants must be legally authorized to work in the United States under the Immigration Reform and Control Act of 1986. Federal regulations prohibit H-1B Visa candidates from paying sponsorship fees, all sponsorship fees must be assumed by the potential employer.\n  <br> \n  <br> Applicants who have education obtained outside of the United States will be required to provide proof of the equivalent United States education as determined by a foreign credential evaluation service, such as the National Association of Credential Evaluation Service (http://www.naces.org) or the Collegiate Registrars &amp; World Education Services: International Credential Evaluation (https://www.wes.org/).\n  <br> \n  <br> The incumbent in this position may be a member of a covered bargaining unit.\n  <br> \n  <br> WE ARE AN EQUAL OPPORTUNITY EMPLOYER, MDOT MAA does not discriminate based on age, ancestry, color, creed, gender identity or expression, genetic information, marital status, mental or physical disability, national origin, race, religious affiliation, belief or opinion, sex, or sexual orientation.\n  <b> 5/23/2022Re-Issued: 6/27/2022</b>\n  <br> \n </div>\n <div>\n  <b> Plumber (Skilled Trade Specialist II) Supplemental Questionnaire:</b>\n </div>\n <ul>\n  <li> Do you possess at least a Class C driver's license valid in the state of Maryland?\n   <ul>\n    <li> Yes:</li>\n    <li> No:</li>\n   </ul></li>\n  <li> If yes, please provide your driver's license number and the expiration date. If no, please answer N/A.</li>\n </ul>\n <ul>\n  <li>Required Question.</li>\n </ul>\n</div>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 8,
    "companyName": "",
    "jobkey": "3f61106d81ee5cbc",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p><b>Summary:</b></p> \n <p> The Mid-Atlantic Permanente Medical Group (MAPMG) proudly provides the highest quality integrated care for over 780,000 members in Virginia, Maryland, and the District of Columbia. We invite applications for a full-time specialist in <b>Internal Medicine or Family Medicine</b> at our <b>Abingdon Medical Center</b>.</p> \n <p><b> Now offering a $150,000 forgivable loan as a new hire incentive!</b></p> \n <p> In collaboration with the Kaiser Foundation Health Plan of the Mid-Atlantic States we provide high-quality, patient centered health care. Through this partnership, our physicians are part of an industry-leading health care delivery model, having access to advanced technological tools and receiving comprehensive practice support.</p> \n <p> MAPMG physicians are salaried, without the pressures of alternative payment models or fee-for-services. Our members have easy access to specialists and medical records, thus allowing you to treat the whole patient.</p> \n <p><b> Responsibilities:</b></p> \n <ul> \n  <li>Staff between 7 and 10 clinical sessions per week, with approximately 4 to 4 ½ working hours per clinical session</li> \n  <li>Provide primary care for a panel of approximately 2000 patients per 10 clinical sessions, adjusted for age, gender and medical acuity</li> \n  <li>Document visit notes and post-visit summaries in EPIC EMR</li> \n  <li>Treat patients in clinic and via video/phone</li> \n </ul> \n <p><b>Minimum Requirements:</b></p> \n <ul> \n  <li>MD or DO</li> \n  <li>Board Certified or Eligible</li> \n  <li>Currently licensed or able to obtain licenses in the District of Columbia, Maryland, and Virginia</li> \n  <li>Work visa sponsorship is available for eligible applicants</li> \n </ul> \n <p><b>Our physicians also:</b></p> \n <ul> \n  <li>Practice patient-centered, culturally competent medical care</li> \n  <li>Communicate thoughtfully (listen, educate, advocate)</li> \n  <li>Lead with integrity</li> \n  <li>Value teamwork</li> \n  <li>Are transparent and honest</li> \n  <li>Go “above and beyond” for their patients</li> \n </ul> \n <p><b>In return we provide:</b></p> \n <ul> \n  <li>Competitive compensation</li> \n  <li>Pathway for physicians to become shareholders of MAPMG</li> \n  <li>Comprehensive benefits including 100% employer-funded medical and dental insurance premiums, a pension plan and 401(k), life insurance, and paid leave</li> \n  <li>Complete professional liability coverage provided at no cost, 100% reimbursement for obtaining and maintaining board certification, continuing medical education reimbursement, and in-house CME opportunities</li> \n  <li>A concierge service that works directly with you to apply for all required state, CDS, and DEA licenses</li> \n </ul> \n <p><b>Equity, Inclusion, and Diversity:</b></p> \n <p> MAPMG continuously works to identify and mitigate healthcare inequities, and that starts with providing an inclusive, supportive environment for our physicians. We encourage applicants of any race, color, religion, sex, sexual orientation, gender identity, or national origin who value diversity and will commit to practicing culturally competent healthcare.</p> \n <p> #DOX-1 #HECRH</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 7,
    "companyName": "",
    "jobkey": "f7bbed2c5b0b7a8b",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p><b>Summary:</b></p> \n <p> The Mid-Atlantic Permanente Medical Group (MAPMG) proudly provides the highest quality integrated care for over 800,000 members in Virginia, Maryland, and the District of Columbia. We invite applications for a full-time specialist in <b>Internal Medicine or Family Medicine</b> at our <b>Abingdon Medical Center</b>.</p> \n <p><b> Now offering a $250,000 forgivable loan as a new hire incentive!</b></p> \n <p> In collaboration with the Kaiser Foundation Health Plan of the Mid-Atlantic States we provide high-quality, patient centered health care. Through this partnership, our physicians are part of an industry-leading health care delivery model, having access to advanced technological tools and receiving comprehensive practice support.</p> \n <p> MAPMG physicians are salaried, without the pressures of alternative payment models or fee-for-services. Our members have easy access to specialists and medical records, thus allowing you to treat the whole patient.</p> \n <p><b> Responsibilities:</b></p> \n <ul> \n  <li>Staff between 7 and 10 clinical sessions per week, with approximately 5 to 5 ½ working hours per clinical session</li> \n  <li>Provide primary care for a panel of approximately 2000 patients per 10 clinical sessions, adjusted for age, gender and medical acuity</li> \n  <li>Document visit notes and post-visit summaries in EPIC EMR</li> \n  <li>Treat patients in clinic and via video/phone</li> \n </ul> \n <p><b>Minimum Requirements:</b></p> \n <ul> \n  <li>MD or DO</li> \n  <li>Board Certified or Eligible</li> \n  <li>Currently licensed or able to obtain licenses in the District of Columbia, Maryland, and Virginia</li> \n  <li>Work visa sponsorship is available for eligible applicants</li> \n </ul> \n <p><b>Our physicians also:</b></p> \n <ul> \n  <li>Practice patient-centered, culturally competent medical care</li> \n  <li>Communicate thoughtfully (listen, educate, advocate)</li> \n  <li>Lead with integrity</li> \n  <li>Value teamwork</li> \n  <li>Are transparent and honest</li> \n  <li>Go “above and beyond” for their patients</li> \n </ul> \n <p><b>In return we provide:</b></p> \n <ul> \n  <li>Competitive compensation</li> \n  <li>Pathway for physicians to become shareholders of MAPMG</li> \n  <li>Comprehensive benefits including 100% employer-funded medical and dental insurance premiums, a pension plan and 401(k), life insurance, and paid leave</li> \n  <li>Complete professional liability coverage provided at no cost, 100% reimbursement for obtaining and maintaining board certification, continuing medical education reimbursement, and in-house CME opportunities</li> \n  <li>A concierge service that works directly with you to apply for all required state, CDS, and DEA licenses</li> \n </ul> \n <p><b>Equity, Inclusion, and Diversity:</b></p> \n <p> MAPMG continuously works to identify and mitigate healthcare inequities, and that starts with providing an inclusive, supportive environment for our physicians. We encourage applicants of any race, color, religion, sex, sexual orientation, gender identity, or national origin who value diversity and will commit to practicing culturally competent healthcare.</p>\n</div>\n<p></p>"
  },
  {
    "keyword": "visa sponsorship",
    "location": "Baltimore",
    "page": 18,
    "position": 6,
    "companyName": "",
    "jobkey": "cdacc0f68f66fe7c",
    "jobTitle": "",
    "jobDescription": "<p></p>\n<div>\n <p>The Mid-Atlantic Permanente Medical Group (MAPMG) proudly provides the highest quality integrated care for over 800,000 members in Virginia, Maryland, and the District of Columbia. We invite applications for a full-time specialist in <b>Interventional Cardiology </b>at our <b>Lutherville-Timonium Medical Center.</b></p> \n <p> In collaboration with the Kaiser Foundation Health Plan of the Mid-Atlantic States we provide high-quality, patient centered health care. Through this partnership, our physicians are part of an industry-leading health care delivery model, having access to advanced technological tools and receiving comprehensive practice support.</p> \n <p> MAPMG physicians are salaried, without the pressures of alternative payment models or fee-for-services. Our members have easy access to specialists and medical records, thus allowing you to treat the whole patient.</p> \n <p><b> Responsibilities:</b></p> \n <ul> \n  <li>Candidates must be experienced in performing peripheral interventions.</li> \n  <li>Interest in program building and leadership a plus.</li> \n </ul> \n <p><b>Minimum Requirements:</b></p> \n <ul> \n  <li>MD or DO</li> \n  <li>Board Certified or Eligible</li> \n  <li>Currently licensed or able to obtain licenses in the District of Columbia, Maryland, and Virginia</li> \n  <li>Work visa sponsorship is available for eligible applicants</li> \n </ul> \n <p><b>Our physicians also:</b></p> \n <ul> \n  <li>Practice patient-centered, culturally competent medical care</li> \n  <li>Communicate thoughtfully (listen, educate, advocate)</li> \n  <li>Lead with integrity</li> \n  <li>Value teamwork</li> \n  <li>Are transparent and honest</li> \n  <li>Go “above and beyond” for their patients</li> \n </ul> \n <p><b>In return we provide:</b></p> \n <ul> \n  <li>Competitive compensation</li> \n  <li>Pathway for physicians to become shareholders of MAPMG</li> \n  <li>Comprehensive benefits including 100% employer-funded medical and dental insurance premiums, a pension plan and 401(k), life insurance, and paid leave</li> \n  <li>Complete professional liability coverage provided at no cost, 100% reimbursement for obtaining and maintaining board certification, continuing medical education reimbursement, and in-house CME opportunities</li> \n  <li>A concierge service that works directly with you to apply for all required state, CDS, and DEA licenses</li> \n </ul> \n <p><b>Equity, Inclusion, and Diversity:</b></p> \n <p> MAPMG continuously works to identify and mitigate healthcare inequities, and that starts with providing an inclusive, supportive environment for our physicians. We encourage applicants of any race, color, religion, sex, sexual orientation, gender identity, or national origin who value diversity and will commit to practicing culturally competent healthcare.</p>\n</div>\n<p></p>"
  }
]